//PRACJOB JOB  (123),'KEVIN',CLASS=A,
//             MSGCLASS=X,
//             MSGLEVEL=(1,1),
//             NOTIFY=&SYSUID
//STEP1   EXEC PGM=IEFBR14
