       IDENTIFICATION DIVISION.                                         00010000
       PROGRAM-ID FUNC.                                                 00020000
       ENVIRONMENT DIVISION.                                            00030000
       DATA DIVISION.                                                   00040000
       WORKING-STORAGE SECTION.                                         00050000
       PROCEDURE DIVISION.                                              00060000
           DISPLAY FUNCTION MAX(1 2 3 4)                                00070000
           DISPLAY FUNCTION MIN(1 2 3 4)                                00080000
           DISPLAY FUNCTION SUM(1 2)                                    00081000
           DISPLAY FUNCTION SQRT(4)                                     00082000
           DISPLAY FUNCTION REM(12 2) *0                                00083000
           STOP RUN.                                                    00090000
