//COBCOMP JOB  (123),'KEVIN',CLASS=A,
//             MSGCLASS=X,
//             MSGLEVEL=(1,1),
//             NOTIFY=&SYSUID
//STEP1   EXEC IGYWCL
//STEPLIB DD   DSN=CEE.SCEELKED,DISP=SHR
//COBOL.SYSIN DD DSN=IBMUSER.COBOL(FILESHAN),DISP=SHR
//LKED.SYSLMOD DD DSN=IBMUSER.LOADLIB(FILESHAN),DISP=SHR
