//CRFILE   JOB 'KEVIN',NOTIFY=&SYSUID,MSGCLASS=A,MSGLEVEL=(1,)
//STEP1    EXEC PGM=IEFBR14
//MYFILE   DD DSN=KEVIN.TEST.FILE,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(1,1)),
//            UNIT=SYSDA
//
