//RUNCOB  JOB  (123),'KEVIN',CLASS=A,
//             MSGCLASS=X,
//             MSGLEVEL=(1,1),
//             NOTIFY=&SYSUID
//* *************
//* RUN A COMPILED COBOL PROGRAM
//* **************
//STEP1   EXEC PGM=FILESHAN
//STEPLIB DD   DSN=IBMUSER.LOADLIB,DISP=SHR
//MYDD    DD   DSN=IBMUSER.INPUT.TEST,DISP=SHR
//SYSOUT  DD   SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSIN   DD   DUMMY

